# coding=utf8
from collections import OrderedDict
import numpy as np

class textrank_keywords():
    """Extract keywords from text"""
    
    def __init__(self):
        self.d = 0.85 # damping coefficient, usually is .85
        self.min_diff = 1e-5 # convergence threshold
        self.steps = 10 # iteration steps
        self.node_weight = None # save keywords and its weight

    
    def set_stopwords(self, stopwords):  
        """Set stop words"""
        for word in STOP_WORDS.union(set(stopwords)):
            lexeme = nlp.vocab[word]
            lexeme.is_stop = True
    
    def sentence_segment(self, doc, lower):
        """Store those words only in cadidate_pos"""
        sentences = []
        for sent in doc.sents:
            selected_words = []
            for token in sent:
                # Store words only with cadidate POS tag
                if token.is_stop is False:
                    if lower is True:
                        selected_words.append(token.text.lower())
                    else:
                        selected_words.append(token.text)
            sentences.append(selected_words)
        return sentences
        
    def get_vocab(self, sentences):
        """Get all tokens"""
        vocab = OrderedDict()
        i = 0
        for sentence in sentences:
            for word in sentence:
                if word not in vocab:
                    vocab[word] = i
                    i += 1
        return vocab
    
    def get_token_pairs(self, window_size, sentences):
        """Build token_pairs from windows in sentences"""
        token_pairs = list()
        for sentence in sentences:
            for i, word in enumerate(sentence):
                for j in range(i+1, i+window_size):
                    if j >= len(sentence):
                        break
                    pair = (word, sentence[j])
                    if pair not in token_pairs:
                        token_pairs.append(pair)
        return token_pairs
        
    def symmetrize(self, a):
        return a + a.T - np.diag(a.diagonal())
    
    def get_matrix(self, vocab, token_pairs):
        """Get normalized matrix"""
        # Build matrix
        vocab_size = len(vocab)
        g = np.zeros((vocab_size, vocab_size), dtype='float')
        for word1, word2 in token_pairs:
            i, j = vocab[word1], vocab[word2]
            g[i][j] = 1
            
        # Get Symmeric matrix
        g = self.symmetrize(g)
        
        # Normalize matrix by column
        norm = np.sum(g, axis=0)
        g_norm = np.divide(g, norm, where=norm!=0) # this is ignore the 0 element in norm
        
        return g_norm

    
    def get_keywords(self, number=10):
        """Print top number keywords"""
        node_weight = OrderedDict(sorted(self.node_weight.items(), key=lambda t: t[1], reverse=True))
        for i, (key, value) in enumerate(node_weight.items()):
            print(key + ' - ' + str(value))
            if i > number:
                break
        
        
    def analyze(self, text, 
                window_size=4, lower=False, stopwords=list()):
        """Main function to analyze text"""
        
        self.set_stopwords(stopwords)
        
        doc = nlp(text)
        
        # Filter sentences
        sentences = self.sentence_segment(doc, lower) # list of list of words
        
        # Build vocabulary
        vocab = self.get_vocab(sentences)
        
        # Get token_pairs from windows
        token_pairs = self.get_token_pairs(window_size, sentences)
        
        # Get normalized matrix
        g = self.get_matrix(vocab, token_pairs)
        
        # Initionlization for weight(pagerank value)
        pr = np.array([1] * len(vocab))
        
        # Iteration
        previous_pr = 0
        for epoch in range(self.steps):
            pr = (1-self.d) + self.d * np.dot(g, pr)
            if abs(previous_pr - sum(pr))  < self.min_diff:
                break
            else:
                previous_pr = sum(pr)

        # Get weight for each node
        node_weight = dict()
        for word, index in vocab.items():
            node_weight[word] = pr[index]
        
        self.node_weight = node_weight

text = '''इकाई अध्यायों स्वतंत्रता पूर्व नियोजित विकास चार दशकों भारत चुने पथ समग्र रूप अवलोकन करेंगे  तात्पर्य भारत सरकार कठोर उपाय किये     योजना आयोग निर्माण पंचवर्षीय योजनाओं घोषणा अध्ययन  पंचवर्षीय योजनाओं समग्र अवलोकन नियोजित विकास विशेषताओं परिसीमाओं मूल्यांकन अध्ययन इकाई है  अध्याय पढ़ने ख स्वतंत्रता प्राप्ति वर्ष 1947 भारत अर्थव्यवस्था दशा जानेंगे  ख भारतीय अर्थव्यवस्था अल्प विकास गत्यावरोध स्थिति पहुँचा देने कारकों परिचित होंगे  पुस्तक मूल उद्देश्य आपको भारतीय अर्थव्यवस्था मूलभूत विशेषताओं जानकारी देना स्वतंत्रता प्राप्ति विकास अवगत कराना है  यद्यपि  देश वर्तमान अवस्था भविष्य संभावनाओं चर्चा आर्थिक अतीत ध्यान देना उतना महत्त्वपूर्ण होगा  ईसलिए चर्चा आरंभ स्वतंत्रता पूर्व देश अर्थव्यवस्था स्थिति हैं  मूल सूत्र इतिहास गहरे हैं  विशेष रूप अवधि भारत 15 अगस्त  1947 स्वतंत्रता प्राप्ति पूर्व दौ सौ वर्षा एं ब्रिटिश शासन अधीन था  भारत ब्रिटिश औपनिवेशिक शासन मुख्य उद्देश्य इंग्लैंड तेज़ी विकसित औद्योगिक आधार भारतीय अर्थव्यवस्था केवल कच्चा माल प्रदायक सीमित रखना था  शासन अधीनता शोषक स्वरूप समझे बिना स्वतंत्रता पिछले छह दशकों में  भारत विकास सही मूल्यांकन पाना संभव नहीं  अंग्रेज़ी शासन स्थापना पूर्व भारत स्वतंत्र अर्थव्यवस्था थी  टाटा आयरन स्टील कंपनी  ज्प् ऐब्व्  स्थापना 1907 हुई  विश्व युद्ध चीनी  कागज़ कारखाने स्थापित हुए  किंतु  भारत भावी औद्योगीकरण प्रोत्साहित हेतु पूँजीगत उद्योगों प्रायः अभाव बना रहा  पूंzजीगत उद्योग उद्योग तत्कालिक उपभोग काम आने वाली वस्तुओं उत्पादन मशीनों कलपुर्जों निर्माण हैं  यत्र   तत्र कारखानों स्थापना देश पारंपरिक शिल्प कला आधारित निर्माणशालाओं पतन भरपाई पाईं  नहीं  नव औद्यागिक क्षेत्रक संवृद्धि दर सकल घरेलू ऊ  देशीय  उत्पाद योगदान रहा  नए उत्पादन क्षेत्रक महत्त्वपूर्ण कमी सार्वजनिक क्षेत्रक कार्यक्षेत्र रहा  वास्तव में  क्षेत्रक प्रायः रेलों  विद्युत उत्पादन  संचार  बंदरगाहों विभागीय उपक्रमों सीमित थे  बीसवीं शताब्दी आरंभिक वर्षों लोहा इस्पात उद्योग विकास प्रारंभ हुआ  वर्ष 1921 पूर्व भारत जनांकिकीय संक्रमण प्रथम सोपान द्वितीय सोपान आरंभ 1921 माना किंतु  न भारत जनसंख्या विशाल न संवृद्धि दर थी  सामाजिक विकास विभिन्न सूचक उत्साहवर्धक मिलाकर साक्षरता दर 16 प्रतिशत महिला साक्षरता दर नगण्य  केवल 7 प्रतिशत आँकी थी  जन   स्वास्थ्य सेवाएँ सुलभ  जहाँ सुविधाएँ उपलब्ध भी  नितांत अपर्याप्त परिणामस्वरूप  जल वायु सहारे फैलने संक्रमण रोगों प्रकोप था  उनसे व्यापक जन   हानि आम बात थी  आश्चर्य सकल मृत्यु दर ऊँची थी  विशेष रूप शिशु मृत्यु दर चां ऐकाने वाली थी  भले हमारे देश शिशु मृत्यु दर 63 हजार है  दर 218 हजार थी  जीवन प्रत्याशा स्तर 63 वर्ष तुलना केवल 32 वर्ष था  अंग्रेज़ों 1850 भारत रेलों आरंभ किया  सबसे महत्त्वपूर्ण योगदान माना है  रेलों भारत अर्थव्यवस्था संरचना महत्त्वपूर्ण तरीकों प्रभावित किया  इससे लोगों भूक्षेत्रीय सांस्कृतिक व्यवधानों आसानी लंबी यात्राएँ अवसर प्राप्त हुए  दूसरी ओर भारतीय कृषि व्यावसायीकरण बढ़ावा मिला  दूसरी ओर डाक सेवाएँ अवश्य जनसामान्य सुविधा प्रदान थीं  किंतु अपर्याप्त थीं  आधारिक संरचनाओं वर्तमान अवस्था विषय आपको अध्याय   8 विस्तृत जानकारी दी जाएगी  देश लगभग 85 प्रतिशत जनसंख्या  कृषि क्षेत्रक गतिहीनता मुख्य कारण औपनिवेशिक शासन लागू भू   व्यवस्था प्रणालियों माना है  समस्त पूर्वी भारत में  बंगाल प्रेसीडेंसी था  लागू जमींदारी व्यवस्था कृषि कार्यों समस्त लाभ जमींदार हड़प थे  किसानों पास बच पाता था  नहीं  जमींदारों औपनिवेशिक शासकों कृषि क्षेत्रक दशा सुधारने जमींदारों रुचि किसानों आर्थिक दुर्दशा अनदेखी कर  उनसे लगान संग्रह सीमित थी  कारण  कृषक नितांत दुर्दशा सामाजिक तनावों झेलने बाध्य पड़ा  राजस्व व्यवस्था शर्ता एं जमींदारों व्यवहार विकास योगदान है  राजस्व निश्चित राशि सरकार कोष जमा कराने तिथियाँ पूर्व निर्धारित ग अनुसार रकम जमा करा पाने जमींदारों अधिकार छीन थे  कृषि सबसे व्यवसाय था  70   75 प्रतिशत जनसंख्या लगी थी  मद्रास प्रेसीडेंसी  आज तमिलनाडु  आंध्र  कर्नाटक केरल प्रांतों क्षेत्रों   मुंबई बंगाल क्षेत्रों कार्यबल कृषि क्षेत्रक निर्भरता कमी आ थी  विनिर्माण सेवा क्षेत्रकों महत्त्व तदनुरूप बढ़ था  किंतु अवधि पंजाब  राजस्थान उड़ीसा क्षेत्रों कृषि लगे श्रमिकों अनुपात वृद्धि आँकी गई  अंग्रेज़ी शासन सड़कें आधुनिक यातायात साधनों उपयुक्त सड़कें उन्होंने बनाईं  ध्येय देश सेनाओं आवागमन सुविधा देश भीतरी भागों कच्चे माल निकटतम रेलवे स्टेशन  ग्रामीण क्षेत्रों माल पहुँचाने सक्षम मौसम उपयोग सड़क मार्गों अभाव निरंतर बना रहा  स्वाभाविक प्राकृतिक आपदाओं अकाल स्थिति ग्रामीण क्षेत्रों बसे देशवासियों जीवन कठिनाइयों कारण दूभर था  1  भारत औपनिवेशिक शासन आर्थिक नीतियों केंद्र बिंदु था  2  औपनिवेशिक काल भारत राष्ट्रीय आय आकलन प्रमुख अर्थशास्त्रियों नाम बताइए  3  औपनिवेशिक शासनकाल कृषि गतिहीनता मुख्य कारण थे  4  स्वतंत्रता देश कार्य आधुनिक उद्योगों नाम बताइए  5  स्वतंत्रता पूर्व अंग्रेज़ों भारत व्यवस्थित वि   औद्योगीकरण दोहरे ध्येय थे  6  अंग्रेज़ी शासन भारत परंपरागत हस्तकला उद्योगों विनाश हुआ  उत्तर पक्ष कारण बताइए  7  भारत आधारिक सरंचना विकास नीतियों अंग्रेज़ उद्देश्य चाहते थे  8  ब्रिटिश औपनिवेशिक प्रशासन अपनाई औद्योगिक नीतियों कमियों आलोचनात्मक विवेचना करें  9  औपनिवेशिक काल भारतीय संपत्ति निष्कासन समझते हैं  15  स्वतंत्रता भारत विदेशी व्यापार परिमाण दिशा जानकारी दें  1  स्वतंत्रता पूर्व भारत ग्रामीण शहरी क्षेत्रों लोगों उपलब्ध वस्तुओं सेवाओं सूची बनाइए  सूची उपभोग स्वरूप तुलना करें  प्रकार जन   सामान्य जीवन स्तर आए परिवर्तनों आकलन करें  2  आस   पास गाँवों शहरों स्वतंत्रता पूर्व चित्र संग्रहित करें  परिदृश्यों मिला देखें  उसमें परिवर्तन देखते हैं  इनमें आए परिवर्तन सुखद दुखद  चर्चा करें  3  शिक्षक सहयोग विषय परिचर्चा करें  भारत जमींदारी प्रथा सचमुच उन्मूलन है  सामान्य मत नकारात्मक है  आपके विचार समाप्त कदम उठाए क्यों  4  स्वतंत्रता हमारे देश जनता आजीविका   कार्य करती थी  जनता मुख्य व्यवसाय हैं  देश चल आर्थिक सुधारों ध्यान रखकर वर्ष 2020 प्रकार व्यावसायिक परिदृश्य कल्पना करेंगे  परिचय व्यष्टि अर्थशास्त्र मूलभूत अध्ययन अवश्य पूर्व परिचित होंगे  अध्याय आरंभ आपको व्यष्टि अर्थशास्त्र समष्टि अर्थशास्त्र अंतर सरलीकृत विवरण प्रस्तुत गया  परिचित होंगे  चलकर उच्चतर अध्ययन अर्थशास्त्र विशिष्टता प्राप्त चुनाव करेंगे  समष्टि अर्थशास्त्र अध्ययन अर्थशास्त्रियों उपयोग जटिल विश्लेषणों अवगत होंगे  किंतु समष्टि अर्थशास्त्र अध्ययन मूल प्रश्न वही रहेंगे आप पाएँगे वास्तव व्यापक आर्थिक प्रश्न हैं  जिनका संबंध नागरिकों हैः संपूर्ण रूप कीमतें बढ़ेंगी घटेंगी  संपूर्ण देश अर्थव्यवस्था क्षेत्रकों रोज़गार दशा बेहतर बुरी हालत में  अर्थव्यवस्था अच्छी बुरी  प्रदर्शित संकेतक होगा  राज्य कौन सा कदम उठाएँगे लोगों माँग करेंगे अर्थव्यवस्था दशा सुधार हो  प्रश्न देश पूर्ण रूप सुदृढ अर्थव्यवस्था संबंध विचार प्रेरित हैं  समष्टि अर्थशास्त्र प्रश्नों जटिलताओं विभिन्न स्तरों विचार है  पुस्तक परिचय समष्टि अर्थशास्त्रीय विश्लेषण मूल सिद्धांतों होगा  संभव होगा सिद्धांतों सरल भाषा वर्णन जाएगा  कभी कभी पाठकों कठिनाइयों परिचय करवाने प्रारंभिक बीजगणित प्रयोग जाएगा  देश अर्थव्यवस्था संपूर्ण रूप देखें पाएँगे अर्थव्यवस्था वस्तुओं सेवाओं निर्गत स्तरों संचलन प्रवृत्ति है  उदाहरण लिए  खाद्यान्न निर्गत वृद्धि आमतौर औद्योगिक वस्तुओं निर्गत स्तर बढ़ता है  औद्योगिक वस्तुओं विभिन्न प्रकार वस्तुओं निर्गत वृद्धि ह्रास प्रवृत्ति है  प्रकार से  विभिन्न वस्तुओं सेवाओं कीमत साधारण बढ़ने घटने प्रवृत्ति है  भिन्न भिन्न उत्पादन इकाइयों रोज़गार स्तर घटते बढ़ते देख हैं  अर्थव्यवस्था विभिन्न उत्पादन इकाइयों समस्त निर्गत स्तर  कीमत स्तर रोज़गार स्तर एक दूसरे निकट संबंधित हों  संपूर्ण औ छब्म्त्ज् दवज जव इम तमचनइसपे ईमक ढपउंहम जवचत्र्ष्723ष् समजित्र्ष्49ष्  ऊपकजीत्र्ष्37ष्  ईमपहीजत्र्ष् 55ष्  एतबत्र्ष्सीमब101 2 1 चदहष्धझ 2 समष्टि अर्थशास्त्र परिचय अर्थव्यवस्था विश्लेषण कार्य अपेक्षाकृत आसान है  उपर्युक्त परिवर्तों संबंध व्यक्तिगत  असमग्र  स्तर विचार बजाय अर्थव्यवस्था अंतर्गत उत्पादित वस्तुओं सेवाओं प्रतिनिधि रूप वस्तु विचार हैं  प्रतिनिधि वस्तु उत्पादन स्तर वस्तुओं सेवाओं औसत उत्पादन स्तर अनुकूल होगा  तरह  प्रतिनिधि वस्तु कीमत स्तर रोज़गार स्तर अर्थव्यवस्था सामान्य कीमत रोज़गार स्तर प्रतिबिंबित करेगा  समष्टि अर्थशास्त्र सामान्यतः विश्लेषण सरलीकृत एकल काल्पनिक वस्तु ध्यान केंद्रित देश उत्पादन रोज़गार स्तर संबंध विशेषताओं  जिन्हें परिवर्ती हैं    कीमत  ब्याज दर  मज़दूरी दर  लाभ  इससे है  सरलीकृत सक्षम उपयोगी तरीके अध्ययन सार प्राप्त अधिसंख्य वास्तविक वस्तुओं है  बाज़ार खरीदी बेची हैं  क्योंकि सामान्यतः देखते कीमत  ब्याज  मज़दूरी लाभ  है  कमो बेश वही दूसरी वस्तुओं है  खासतौर गुणों तेजी बदलाव आना शुरू है  कीमतें बढ़ती हैं   जिसे मुद्रास्फीति है  रोज़गार उत्पादन स्तर गिरते  जिसे मंदी है   परिवर्तों संचालन सामान्य दिशा  व्यक्तिगत वस्तुओं सामान्यतः प्रकार है  मिलाकर अर्थव्यवस्था समस्त रूप दिखलाई पड़ती है  देखेंगे कभी कभी उपयोगी सरलीकरण विचलन ओर जायेंगे  अनुभव करेंगे देश अर्थव्यवस्था पूर्ण रूप विभिन्न क्षेत्रकों मिलकर बनती प्रतीत है  निश्चित उद्देश्यों अर्थव्यवस्था क्षेत्रकों  उदाहरण लिए  कृषि उद्योग  अंतर्निर्भरता  यह कीमतों प्रतिद्वंद्विता  क्षेत्रकों संबंध  जैसाकि प्रजातांत्रिक व्यवस्था पारिवारिक क्षेत्रक  व्यापारिक क्षेत्रक सरकार  अर्थव्यवस्था पूर्ण रूप देखने अपेक्षा देश अर्थव्यवस्था चीज़ों अच्छी समझने सहायता मिलती है  विभिन्न वस्तुओं छोड़कर प्रतिनिधि वस्तु ध्यान केंद्रित सुविधाजनक है  प्रक्रिया वस्तु विशेष विशिष्ट गुणों उपेक्षा है  उदाहरणार्थ  कृषि औद्योगिक वस्तुओं उत्पादन दशाएँ बिल्कुल भिन्न प्रकृति प्रकार श्रमिकों श्रमिक प्रतिनिधि कोटि लें  फर्म प्रबंधक लेखाकार श्रम भेद पाएँगे  अतः मामलों वस्तु  श्रम उत्पादन तकनीक  एकल प्रतिनिधि कोटि विभिन्न प्रकार वस्तुएँ ले हैं  उदाहरण अर्थव्यवस्था अंतर्गत उत्पादित प्रकार वस्तुओं लिए  प्रतिनिधि रूप तीन सामान्य प्रकार वस्तुएँ ली हैंH कृषि वस्तुएँ  औद्योगिक वस्तुएँ सेवाएँ  वस्तुओं उत्पादन तकनीक कीमत अंतर है  समष्टि अर्थशास्त्र विश्लेषण प्रयास विभिन्न वस्तुओं व्यक्तिगत निर्गत स्तर  कीमतें  रोज़गार स्तर निर्धारण है  चर्चा व्यष्टि अर्थशास्त्र पूर्व अध्ययन शायद आपको समझ आ होगा समष्टि अर्थशास्त्र  व्यष्टि अर्थशास्त्र प्रकार भिन्न है  संक्षिप्त सार रूप देखें व्यष्टि अर्थशास्त्र आपको  वैयक्तिक आर्थिक एजेंट   बोYक्स देखिए  औ छब्म्त्ज् दवज जव इम तमचनइसपे ईमक 3 परिचय प्रेरणाओं  जिनसे चालित हैं  प्रकृति उल्लेख मिलता है   व्यष्टि   जिसका अर्थ  छोटा  है  एजेंट अर्थात् उपभोक्ता रुचि आय अनुरूप क्रय वस्तुओं इष्टतम संयोग चयन हैं  उत्पादक उत्पादित वस्तुओं अधिकतम लाभ अर्जित लागत रखता वस्तुओं बाज़ार ऊँची ऊँची कीमत बेचता है  शब्दों में  व्यष्टि अर्थशास्त्र माँग पूर्ति व्यक्तिगत बाज़ारों अध्ययन  आर्थिक भूमिका निभाने वाला  निर्णयकर्ता व्यक्ति  व्रेQता विव्रेQता कंपनियाँ भी   लाभों अधिकतम प्रयास  उत्पादक विव्रेQता  व्यक्तिगत संतुष्टि कल्याण स्तर  उपभोक्ता रूप में  बड़ी कंपनी अर्थ  व्यष्टि  शेयर धारकों हितों कार्य पड़ता संपूर्ण देश हित है  व्यष्टि अर्थशास्त्र  मैक्रो  '''
# with open('no_stops.txt','r') as f:
#     text = f.read()
   
textrank_keywords().analyze(text, window_size=4, lower=False)   
textrank_keywords().get_keywords(20)